In [1]:
import pandas as pd

df_SN7577i_a = pd.read_csv("SN7577i_a.csv")
df_SN7577i_b = pd.read_csv("SN7577i_b.csv")

In [2]:
print(df_SN7577i_a)
print(df_SN7577i_b)

   Id  Q1  Q2  Q3  Q4
0   1   1  -1   1   8
1   2   3  -1   1   4
2   3  10   3   2   6
3   4   9  -1  10  10
4   5  10   2   6   1
5   6   1  -1   1   1
6   7   1  -1   1   8
7   8   1  -1   1   1
8   9   9  -1  10  10
9  10   2  -1   1   1
     Id  Q1  Q2  Q3  Q4
0  1277  10  10   4   6
1  1278   2  -1   5   4
2  1279   2  -1   4   5
3  1280   1  -1   2   3
4  1281  10   2   3   4
5  1282   2  -1   3   6
6  1283  10  10   2  10
7  1284   9  -1   8   9
8  1285  11  11   1   2
9  1286  10   6   6   6

In [3]:
df_all_rows = pd.concat([df_SN7577i_a, df_SN7577i_b])
df_all_rows

     Id  Q1  Q2  Q3  Q4
0     1   1  -1   1   8
1     2   3  -1   1   4
2     3  10   3   2   6
3     4   9  -1  10  10
4     5  10   2   6   1
5     6   1  -1   1   1
6     7   1  -1   1   8
7     8   1  -1   1   1
8     9   9  -1  10  10
9    10   2  -1   1   1
0  1277  10  10   4   6
1  1278   2  -1   5   4
2  1279   2  -1   4   5
3  1280   1  -1   2   3
4  1281  10   2   3   4
5  1282   2  -1   3   6
6  1283  10  10   2  10
7  1284   9  -1   8   9
8  1285  11  11   1   2
9  1286  10   6   6   6

In [4]:
df_all_rows=df_all_rows.reset_index(drop=True)
df_all_rows

      Id  Q1  Q2  Q3  Q4
0      1   1  -1   1   8
1      2   3  -1   1   4
2      3  10   3   2   6
3      4   9  -1  10  10
4      5  10   2   6   1
5      6   1  -1   1   1
6      7   1  -1   1   8
7      8   1  -1   1   1
8      9   9  -1  10  10
9     10   2  -1   1   1
10  1277  10  10   4   6
11  1278   2  -1   5   4
12  1279   2  -1   4   5
13  1280   1  -1   2   3
14  1281  10   2   3   4
15  1282   2  -1   3   6
16  1283  10  10   2  10
17  1284   9  -1   8   9
18  1285  11  11   1   2
19  1286  10   6   6   6

In [6]:
df_SN7577i_aa = pd.read_csv("SN7577i_aa.csv")
df_SN7577i_bb = pd.read_csv("SN7577i_bb.csv")

In [7]:
print(df_SN7577i_aa)
print(df_SN7577i_bb)

   Id  Q1  Q2  Q3
0   1   1  -1   1
1   2   3  -1   1
2   3  10   3   2
3   4   9  -1  10
4   5  10   2   6
5   6   1  -1   1
6   7   1  -1   1
7   8   1  -1   1
8   9   9  -1  10
9  10   2  -1   1
     Id  Q1  Q2  Q4
0  1277  10  10   6
1  1278   2  -1   4
2  1279   2  -1   5
3  1280   1  -1   3
4  1281  10   2   4
5  1282   2  -1   6
6  1283  10  10  10
7  1284   9  -1   9
8  1285  11  11   2
9  1286  10   6   6

In [10]:
df_all_rows = pd.concat([df_SN7577i_aa, df_SN7577i_bb])
df_all_rows

     Id  Q1  Q2    Q3    Q4
0     1   1  -1   1.0   NaN
1     2   3  -1   1.0   NaN
2     3  10   3   2.0   NaN
3     4   9  -1  10.0   NaN
4     5  10   2   6.0   NaN
5     6   1  -1   1.0   NaN
6     7   1  -1   1.0   NaN
7     8   1  -1   1.0   NaN
8     9   9  -1  10.0   NaN
9    10   2  -1   1.0   NaN
0  1277  10  10   NaN   6.0
1  1278   2  -1   NaN   4.0
2  1279   2  -1   NaN   5.0
3  1280   1  -1   NaN   3.0
4  1281  10   2   NaN   4.0
5  1282   2  -1   NaN   6.0
6  1283  10  10   NaN  10.0
7  1284   9  -1   NaN   9.0
8  1285  11  11   NaN   2.0
9  1286  10   6   NaN   6.0

In [11]:
df_SN7577i_c = pd.read_csv("SN7577i_c.csv")
df_SN7577i_d = pd.read_csv("SN7577i_d.csv")

In [12]:
print(df_SN7577i_c)
print(df_SN7577i_d)

   Id  maritl  numhhd
0   1       6       3
1   2       4       3
2   3       6       2
3   4       4       1
4   5       4       1
5   6       2       2
6   7       2       2
7   8       2       2
8   9       6       2
9  10       6       1
   Id  Q1  Q2
0   1   1  -1
1   2   3  -1
2   3  10   3
3   4   9  -1
4   5  10   2
5   6   1  -1
6   7   1  -1
7   8   1  -1
8   9   9  -1
9  10   2  -1

In [13]:
df_all_cols = pd.concat([df_SN7577i_c, df_SN7577i_d], axis = 1)
df_all_cols

   Id  maritl  numhhd  Id  Q1  Q2
0   1       6       3   1   1  -1
1   2       4       3   2   3  -1
2   3       6       2   3  10   3
3   4       4       1   4   9  -1
4   5       4       1   5  10   2
5   6       2       2   6   1  -1
6   7       2       2   7   1  -1
7   8       2       2   8   1  -1
8   9       6       2   9   9  -1
9  10       6       1  10   2  -1

In [17]:
df_cd = pd.merge(df_SN7577i_c, df_SN7577i_d, how='inner')
df_cd

   Id  maritl  numhhd  Q1  Q2
0   1       6       3   1  -1
1   2       4       3   3  -1
2   3       6       2  10   3
3   4       4       1   9  -1
4   5       4       1  10   2
5   6       2       2   1  -1
6   7       2       2   1  -1
7   8       2       2   1  -1
8   9       6       2   9  -1
9  10       6       1   2  -1

In [18]:
df_cd = pd.merge(df_SN7577i_c, df_SN7577i_d, how='inner', on = 'Id')
df_cd

   Id  maritl  numhhd  Q1  Q2
0   1       6       3   1  -1
1   2       4       3   3  -1
2   3       6       2  10   3
3   4       4       1   9  -1
4   5       4       1  10   2
5   6       2       2   1  -1
6   7       2       2   1  -1
7   8       2       2   1  -1
8   9       6       2   9  -1
9  10       6       1   2  -1

In [19]:
df_cd = pd.merge(df_SN7577i_c, df_SN7577i_d, how='inner', left_on = 'Id', right_on = 'Id')
df_cd

   Id  maritl  numhhd  Q1  Q2
0   1       6       3   1  -1
1   2       4       3   3  -1
2   3       6       2  10   3
3   4       4       1   9  -1
4   5       4       1  10   2
5   6       2       2   1  -1
6   7       2       2   1  -1
7   8       2       2   1  -1
8   9       6       2   9  -1
9  10       6       1   2  -1